      *************************************************************************
      **
      **    Copyright (C) Micro Focus 1984-2020. All rights reserved.
      **	All rights reserved.
      **
      *************************************************************************
       01 (prefix)-discount-rec.
	    05 (prefix)-code          pic x(03).
	    05 (prefix)-rate          pic S9(3)v99.
	    05 (prefix)-exp-date      pic x(10).
