************************************************************************
*
*       Copyright (C) Micro Focus 1984-2020. All rights reserved.
*       All rights reserved.
*
************************************************************************
           select discFile assign to external discFile
               file status is ws-file-status
               organization is indexed
               access mode is dynamic
               record key is FILE-code
               .
